In [114]:
import pyspark
from pyspark.sql import SparkSession
from pyspark.sql.types import StructType, StructField, IntegerType, StringType
from pyspark.sql.functions import col
from pyspark.sql.functions import max, avg, min
from pyspark.sql.functions import lit
from pyspark.sql.window import Window
from pyspark.sql.functions import row_number
from pyspark.sql.functions import when
import re

In [115]:
spark = SparkSession.builder.master("local").appName("task").config("spark.driver.extraClassPath", "C:\spark\postgresql-42.5.1.jar").getOrCreate()

In [116]:
url = 'jdbc:postgresql://localhost:5432/postgres'
user = 'postgres'
password = '123456'

In [117]:
queries = ['''SELECT COUNT(*), category.name
            FROM film INNER JOIN film_category USING(film_id)
            INNER JOIN category USING(category_id)
            GROUP BY category.name
            ORDER BY COUNT(*) DESC
''',
'''SELECT COUNT(rental.rental_id), actor.first_name, actor.last_name
            FROM film
            INNER JOIN film_actor USING(film_id)
            INNER JOIN actor USING(actor_id) INNER JOIN inventory USING(film_id)
            INNER JOIN rental USING(inventory_id) GROUP BY film.title, actor.first_name, actor.last_name
            ORDER BY COUNT(rental.rental_id) DESC LIMIT 10
''',
'''SELECT db1.title, db1.numOfRented * db2.replacement_cost as total
            FROM (SELECT COUNT (rental.rental_id) as numOfRented, film.title FROM film INNER JOIN film_actor USING(film_id) INNER JOIN actor USING(actor_id) INNER JOIN inventory USING(film_id) INNER JOIN rental USING(inventory_id) GROUP BY film.title) as db1
            INNER JOIN (SELECT film.title, film.replacement_cost FROM film GROUP BY film.title, film.replacement_cost ORDER BY film.replacement_cost DESC) as db2 
            USING(title) 
            ORDER BY total DESC
''',
'''SELECT film.title, film_id
            FROM film
            LEFT JOIN inventory USING(film_id)
            WHERE inventory.film_id IS NULL
            GROUP BY film.title, film_id
            ORDER BY film_id DESC
''',
'''SELECT COUNT(film.title) as numOfFilms, actor.first_name, actor.last_name, category.name as category
            FROM film
            INNER JOIN film_actor USING(film_id)
            INNER JOIN actor USING(actor_id)
            INNER JOIN film_category USING(film_id)
            INNER JOIN category USING(category_id)
            WHERE category.name = 'Children'
            GROUP BY first_name, last_name, category
            HAVING COUNT(film.title) IN (SELECT COUNT(film.title) as numOfFilms FROM film INNER JOIN film_actor USING(film_id) INNER JOIN actor USING(actor_id) INNER JOIN film_category USING(film_id) INNER JOIN category USING(category_id) WHERE category.name = 'Children' GROUP BY actor.first_name, actor.last_name, category.name ORDER BY COUNT(film.title) DESC LIMIT 3)
            ORDER BY numOfFilms DESC
''',
'''SELECT city, COUNT(active) as num_active, COUNT(inactive) as num_inactive FROM
            (SELECT city,
            CASE
            WHEN customer.active = 1
            THEN 'active'
            ELSE NULL
            END as active,
            CASE
            WHEN customer.active != 1
            THEN 'inactive'
            ELSE NULL
            END as inactive
            FROM city
            INNER JOIN address USING(city_id)
            INNER JOIN customer USING(address_id)
            GROUP BY city, customer.active) as db
            GROUP BY city
            ORDER BY num_inactive DESC
''',
'''SELECT category.name, city.city, SUM(DATE_PART('hour', rental.rental_date::date) - DATE_PART('hour', rental.return_date::date) + 1) as hours
            FROM category 
            INNER JOIN film_category USING(category_id)
            INNER JOIN film USING(film_id)
            INNER JOIN inventory USING(film_id)
            INNER JOIN store USING(store_id)
            INNER JOIN address USING(address_id)
            INNER JOIN city USING(city_id)
            INNER JOIN rental USING(inventory_id)
            GROUP BY city.city, category.name
            ORDER BY hours DESC
''']

In [118]:
['query' + str(i+1) for i in range(7)]

['query1', 'query2', 'query3', 'query4', 'query5', 'query6', 'query7']

In [119]:
counter = 1
for query in queries:
    print(f'query number {counter}:')
    jdbcDF = spark.read \
        .format("jdbc") \
        .option("url", url) \
        .option("query", query) \
        .option("user", user) \
        .option("password", password) \
        .load() \
        .show()
    counter+=1

query number 1:
+-----+-----------+
|count|       name|
+-----+-----------+
|   74|     Sports|
|   73|    Foreign|
|   69|     Family|
|   68|Documentary|
|   66|  Animation|
|   64|     Action|
|   63|        New|
|   62|      Drama|
|   61|     Sci-Fi|
|   61|      Games|
|   60|   Children|
|   58|     Comedy|
|   57|     Travel|
|   57|   Classics|
|   56|     Horror|
|   51|      Music|
+-----+-----------+

query number 2:
+-----+----------+-----------+
|count|first_name|  last_name|
+-----+----------+-----------+
|   34|  CHARLIZE|      DENCH|
|   34|       RIP|   CRAWFORD|
|   34|      GARY|    PHOENIX|
|   34|   KIRSTEN|     AKROYD|
|   34|      BURT|     TEMPLE|
|   34|       TIM|    HACKMAN|
|   33|     CHRIS|    BRIDGES|
|   33|     MERYL|      ALLEN|
|   33|      JUDY|       DEAN|
|   33|     JAYNE|SILVERSTONE|
+-----+----------+-----------+

query number 3:
+--------------------+--------------------+
|               title|               total|
+--------------------+--------------------+
|     DRACULA CRYSTAL|7368.270000000000...|
|      SATURDAY LAMBS|7305.480000000000...|
|     IDOLS SNATCHERS|7197.600000000000...|
|        HOBBIT ALIEN|6941.520000000000...|
|     STORM HAPPINESS|6725.680000000000...|
|    FANTASY TROOPERS|6549.660000000000...|
|        FAMILY SWEET|6522.390000000000...|
|    ROCKETEER MOTHER|6465.690000000000...|
|   MOVIE SHAKESPEARE|6045.840000000000...|
|  STRANGELOVE DESIRE|6045.840000000000...|
| GLEAMING JAWBREAKER|6029.680000000000...|
|FLAMINGOS CONNECT...|6000.930000000000...|
|   FLATLINERS KILLER|5938.020000000000...|
|        DOUBLE WRATH|5798.000000000000...|
| HELLFIGHTERS SIERRA|5757.600000000000...|
|  BUCKET BROTHERHOOD|5709.960000000000...|
|   GOODFELLAS SALUTE|5701.520000000000...|
|   HANDICAP BOONDOCK|5682.040000000000...|
|    CUPBOARD SINNERS|5518.160000000000...|
|     SUSPECTS QUILLS|5517.600000000000...|
+--------------------+--------------------+
only showing top 20 rows

query number 4:
+-----------------+-------+
|            title|film_id|
+-----------------+-------+
|     WALLS ARTIST|    955|
|        WAKE JAWS|    954|
|     VOLUME HOUSE|    950|
|VILLAIN DESPERATE|    943|
| TREASURE COMMAND|    909|
|     TADPOLE PARK|    874|
| SUICIDES SILENCE|    860|
|      SKY MIRACLE|    802|
|    SISTER FREDDY|    801|
|    ROOF CHAMPION|    742|
|    RAINBOW SHOCK|    713|
|RAIDERS ANTITRUST|    712|
|    PSYCHO SHRUNK|    701|
|  PERDITION FARGO|    671|
|    PEARL DESTINY|    669|
|   ORDER BETRAYED|    642|
|      MUPPET MILE|    607|
| KILL BROTHERHOOD|    497|
| KENTUCKIAN GIANT|    495|
|      HOCUS FRIDA|    419|
+-----------------+-------+
only showing top 20 rows

query number 5:
+----------+----------+---------+--------+
|numoffilms|first_name|last_name|category|
+----------+----------+---------+--------+
|         7|     HELEN|   VOIGHT|Children|
|         6|     SUSAN|    DAVIS|Children|
|         5|     KEVIN|  GARLAND|Children|
|         5|      MARY|    TANDY|Children|
|         5|     RALPH|     CRUZ|Children|
|         5|    WHOOPI|     HURT|Children|
+----------+----------+---------+--------+

query number 6:
+----------------+----------+------------+
|            city|num_active|num_inactive|
+----------------+----------+------------+
|          Kamyin|         0|           1|
|       Najafabad|         0|           1|
|         Wroclaw|         0|           1|
|     Szkesfehrvr|         0|           1|
|   Coatzacoalcos|         0|           1|
|      Kumbakonam|         0|           1|
|          Amroha|         0|           1|
|Charlotte Amalie|         0|           1|
|          Ktahya|         0|           1|
| Southend-on-Sea|         0|           1|
|       Pingxiang|         0|           1|
|        Xiangfan|         0|           1|
|         Bat Yam|         0|           1|
|          Daxian|         0|           1|
|        Uluberia|         0|           1|
|          Mwanza|         1|           0|
|           Satna|         1|           0|
|           Hanoi|         1|           0|
|  San Bernardino|         1|           0|
|      Battambang|         1|           0|
+----------------+----------+------------+
only showing top 20 rows

query number 7:
+-----------+----------+-----+
|       name|      city|hours|
+-----------+----------+-----+
|     Sports| Woodridge|616.0|
|Documentary| Woodridge|598.0|
|  Animation| Woodridge|589.0|
|     Action|Lethbridge|587.0|
|     Sci-Fi| Woodridge|573.0|
|      Drama|Lethbridge|573.0|
|  Animation|Lethbridge|556.0|
|     Family|Lethbridge|550.0|
|     Sports|Lethbridge|548.0|
|     Family| Woodridge|533.0|
|     Sci-Fi|Lethbridge|520.0|
|    Foreign|Lethbridge|518.0|
|     Action| Woodridge|508.0|
|      Games| Woodridge|507.0|
|    Foreign| Woodridge|504.0|
|        New|Lethbridge|498.0|
|     Comedy|Lethbridge|495.0|
|   Children| Woodridge|490.0|
|   Classics| Woodridge|487.0|
|      Drama| Woodridge|480.0|
+-----------+----------+-----+
only showing top 20 rows